frontend/controllers/CartController.php

SELECT * FROM `product` WHERE `id`='4'
---
    public function actionAdd($id)
    {
        $product = Product::findOne($id);

SELECT * FROM `product` WHERE `id`='10'
---
    public function actionUpdate($id, $quantity)
    {
        $product = Product::findOne($id);

INSERT INTO `order` (`nama`, `email`, `nomor_HP`, `Account_No`, `User_FullName`, `PIN`, `Exp_Month`, `Exp_Year`, `total`, `coupun_code`, `Produk`, `banyak`, `file`, `notes`, `created_at`, `updated_at`, `status`) VALUES ('Heri Wardana', 'ifs15060@students.del.ac.id', '6282160437803', 123, 'HeriWAR', 123, 'January', 2018, 16000, 'A0Tx', 'Art Paper A3', 2, '@web/images/74bdefab9757a081606b181ac29f1db2.jpg', 'Cetak diambil sore', 1516615367, 1516615367, 'New')
INSERT INTO `order_item` (`order_id`, `title`, `price`, `product_id`, `quantity`) VALUES (24, 'Art Paper A3', '10000', 10, 2)
---
    public function actionOrder()
    {
        $order = new Order();

        /* @var $cart ShoppingCart */
        $cart = \Yii::$app->cart;

        /* @var $products Product[] */
        $products = $cart->getPositions();
        $total = $cart->getCost();

        if ($order->load(\Yii::$app->request->post()) && $order->validate()) {
            $order->file = '@web/images/' . $order->file;

            if ($order->coupun_code == "A0Tx" or "A16x" or "A0Txqko1HniiR9ET") {
                $order->total = $order->total - 2000;

            }

            $transaction = $order->getDb()->beginTransaction();
            $order->save(false);

            foreach($products as $product) {
                $orderItem = new OrderItem();
                $orderItem->order_id = $order->id;
                $orderItem->title = $product->title;
                $orderItem->price = $product->getPrice();
                $orderItem->product_id = $product->id;
                $orderItem->quantity = $product->getQuantity();
                if (!$orderItem->save(false)) {